L_shape/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          600;
        startFace       401900;
    }
    outlet
    {
        type            patch;
        nFaces          600;
        startFace       402500;
    }
    Wall_out
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8100;
        startFace       403100;
    }
    Wall_side
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9200;
        startFace       411200;
    }
    Wall_inside
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5700;
        startFace       420400;
    }
)

// ************************************************************************* //
