L_shape/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0 0 0)
	(851 0 0)
    (1133 0 0)
    (0 214 0)
    (851 214 0)
	(1133 214 0)
	(851 1853 0)
	(1133 1853 0)
	(566.5 2135 0)
	(1133 2135 0)
	(566.5 1853 0)
	(851 1853 0)
	(566.5 369.6 0)
	(851 369.6 0)
	(851 214 0)
	(566.5 214 0)
	(0 369.6 0)
	(0 214 0)
    (0 0 161.6)
	(851 0 161.6)
    (1133 0 161.6)
    (0 214 161.6)
    (851 214 161.6)
	(1133 214 161.6)
	(851 1853 161.6)
	(1133 1853 161.6)
	(566.5 2135 161.6)
	(1133 2135 161.6)
	(566.5 1853 161.6)
	(851 1853 161.6)
	(566.5 369.6 161.6)
	(851 369.6 161.6)
	(851 214 161.6)
	(566.5 214 161.6)
	(0 369.6 161.6)
	(0 214 161.6)
	(851 2135 0)
	(851 2135 161.6)

);

blocks
(
    hex (0 1 4 3 18 19 22 21) (40 20 30) simpleGrading (1 1 1)
	hex (1 2 5 4 19 20 23 22) (20 20 30) simpleGrading (1 1 1)
	hex (4 5 7 6 22 23 25 24) (20 50 30) simpleGrading (1 1 1)
	
	hex (6 7 9 36 24 25 27 37) (20 20 30) simpleGrading (1 1 1)
	hex (10 6 36 8 28 24 37 26) (20 20 30) simpleGrading (1 1 1)
	
	hex (12 13 6 10 30 31 24 28) (20 40 30) simpleGrading (1 1 1)
	hex (15 14 13 12 33 32 31 30) (20 20 30) simpleGrading (1 1 1)
	hex (17 15 12 16 35 33 30 34) (20 20 30) simpleGrading (1 1 1)


);



boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 18 21 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (17 35 34 16)
        );
    }
    Wall_out
    {
        type wall;
        faces
        (
		(0 1 19 18)
		(1 2 20 19)
		(2 5 23 20)
		(5 7 25 23)
		(7 9 27 25)
		(9 36 37 27)
		(36 8 26 37)
		(8 10 28 26)
		(10 12 30 28)
		(12 16 34 30)
        );
    }
	Wall_side
	{
		type wall;
		faces
		(
		(4 1 0 3)
		(5 2 1 4)
		(7 5 4 6)
		(9 7 6 36)
		(36 6 10 8)
		(10 6 13 12)
		(14 15 12 13)
		(15 17 16 12)
		(22 21 18 19)
		(20 23 22 19)
		(22 23 25 24)
		(26 28 24 37)
		(37 24 25 27)
		(30 31 24 28)
		(33 32 31 30)
		(35 33 30 34)
		);	
	}
	Wall_inside
	{
		type wall;
		faces
		(
		(3 21 22 4)
		(6 4 22 24)
		(13 6 24 31)
		(14 13 31 32)
		(15 14 32 33)
		(17 15 33 35)
		);
	}
);





// ************************************************************************* //

